.emacs.d/snippets/text-mode/org-mode/cpp_coding_std.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>cpp<sub>coding</sub><sub>std</sub></title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-11-22 14:50:14 EST"/>
<meta name="author" content="Matthew J. Lenzo"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">cpp<sub>coding</sub><sub>std</sub></h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 C++ Coding Standard </a>
<ul>
<li><a href="#sec-1-1">1.1 Purpose </a></li>
<li><a href="#sec-1-2">1.2 File Conventions </a></li>
<li><a href="#sec-1-3">1.3 Header Files </a></li>
<li><a href="#sec-1-4">1.4 Type Definitions </a></li>
<li><a href="#sec-1-5">1.5 Variables </a></li>
<li><a href="#sec-1-6">1.6 Constants and Enumerators </a></li>
<li><a href="#sec-1-7">1.7 Constructors </a></li>
<li><a href="#sec-1-8">1.8 Inheritance </a></li>
<li><a href="#sec-1-9">1.9 Access Control </a></li>
<li><a href="#sec-1-10">1.10 Functions &amp; Methods </a></li>
<li><a href="#sec-1-11">1.11 Macros &amp; Preprocessor </a></li>
<li><a href="#sec-1-12">1.12 File Commments </a></li>
<li><a href="#sec-1-13">1.13 Class Comments </a></li>
<li><a href="#sec-1-14">1.14 Function &amp; Method Comments </a></li>
<li><a href="#sec-1-15">1.15 Variable Comments </a></li>
<li><a href="#sec-1-16">1.16 Spacing </a></li>
<li><a href="#sec-1-17">1.17 Indent </a></li>
<li><a href="#sec-1-18">1.18 Function Formatting </a></li>
<li><a href="#sec-1-19">1.19 Conditional Formatting </a></li>
<li><a href="#sec-1-20">1.20 Loop Formatting </a></li>
<li><a href="#sec-1-21">1.21 Class Formatting </a></li>
<li><a href="#sec-1-22">1.22 Struct Formatting </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-3">
<h3 id="sec-1"><span class="section-number-3">1</span> C++ Coding Standard </h3>
<div class="outline-text-3" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-4">
<h4 id="sec-1-1"><span class="section-number-4">1.1</span> Purpose </h4>
<div class="outline-text-4" id="text-1-1">

<p>Adhere to this basic style document to produce manageable, safe,
consistent, readable, and measurable C++ code.  This standard has been
adapted from the Google C++ Style Guide.
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-4">
<h4 id="sec-1-2"><span class="section-number-4">1.2</span> File Conventions </h4>
<div class="outline-text-4" id="text-1-2">

<p>All C++ source files shall use the .cc file extension and all C++
header files shall use the .h file extension.  Every source file shall
have a corresponding header file, except in the case of program entry
points and unit test cases.  Filenames shall be all lowercase and may
include underscores or dashes:
</p>
<p>
<code>mycode.cc</code>, <code>mycode.h</code>, <code>main.cc</code>
</p>
</div>

</div>

<div id="outline-container-1-3" class="outline-4">
<h4 id="sec-1-3"><span class="section-number-4">1.3</span> Header Files </h4>
<div class="outline-text-4" id="text-1-3">

<p>All C++ header files shall use #define guards to prevent multiple
inclusion.  The format of this guard shall be:
</p>



<pre class="src src-C++">#ifndef &lt;PROJECT&gt;_&lt;FILE&gt;_H
#define &lt;PROJECT&gt;_&lt;FILE&gt;_H
...
#endif
</pre>




</div>

</div>

<div id="outline-container-1-4" class="outline-4">
<h4 id="sec-1-4"><span class="section-number-4">1.4</span> Type Definitions </h4>
<div class="outline-text-4" id="text-1-4">

<p>All type names for <b>class</b>, <b>struct</b>, <b>typedef</b>, <b>union</b>, and <b>enum</b>
must start with a capital letter for each word without underscores
(i.e. mixed case).  Do not use reserved keywords in the type name:
</p>
<p>
<code>MyClass</code>, <code>MyEnum</code>, <code>MyStruct</code>, <code>MyType</code>
</p>
</div>

</div>

<div id="outline-container-1-5" class="outline-4">
<h4 id="sec-1-5"><span class="section-number-4">1.5</span> Variables </h4>
<div class="outline-text-4" id="text-1-5">

<p>Variable names shall be declared in all lowercase with underscores
separating words.  Class member variables shall begin with <code>m_</code>.  Do
not use reserved keywords in the type name:
</p>
<p>
<code>word_count</code>, <code>sleep_counter</code>, <code>m_word_counter</code>, <code>m_sleep_counter</code>
</p>
<p>
Variable initialization shall be used in place of declaration and then
subsequent assignment.
</p>



<pre class="src src-C++">/* Good Example */
int z = init();
/* Bad Example */
int z;
z = init();
</pre>




<p>
Use C++ style casts such as <code>static_cast&lt;&gt;()</code> over c-style casts.
</p>
<p>
Use <code>0</code> for integers, <code>0.0</code> for reals, and <code>NULL</code> for pointer values.
</p>
</div>

</div>

<div id="outline-container-1-6" class="outline-4">
<h4 id="sec-1-6"><span class="section-number-4">1.6</span> Constants and Enumerators </h4>
<div class="outline-text-4" id="text-1-6">

<p>For constant names and enumerator values, use k followed by mixed
case:
</p>
<p>
<code>kConstantValue</code>, <code>kEnumValue1</code>, <code>kEnumValue2</code>
</p>
</div>

</div>

<div id="outline-container-1-7" class="outline-4">
<h4 id="sec-1-7"><span class="section-number-4">1.7</span> Constructors </h4>
<div class="outline-text-4" id="text-1-7">

<p>Default constructors must be defined for all classes with member
variables.  Always use the C++ keyword <b>explicit</b> for constructors
with only one argument.
</p>
<p>
If not defining copy and assignment constructors, always disable them
through private declaration.
</p>



<pre class="src src-C++">private:
  TypeName(const TypeName&amp;);
  void operator=(const TypeName&amp;);
</pre>




</div>

</div>

<div id="outline-container-1-8" class="outline-4">
<h4 id="sec-1-8"><span class="section-number-4">1.8</span> Inheritance </h4>
<div class="outline-text-4" id="text-1-8">

<p>Classes with virtual methods shall have virtual destructors.
</p>
<p>
Multiple inheritance shall only be permitted when at most one of the
base classes has implementation.  All other classes must be pure
interfaces.  Pure interfaces should be named starting with an "<code>I</code>".
</p>
</div>

</div>

<div id="outline-container-1-9" class="outline-4">
<h4 id="sec-1-9"><span class="section-number-4">1.9</span> Access Control </h4>
<div class="outline-text-4" id="text-1-9">

<p><b>public</b> members shall be declared before <b>private</b> and <b>protected</b>
 members.  Methods shall be declared before variables.
</p>
<p>
All data members shall be marked <b>private</b> and only accessible through
explicit accessor and mutator methods.
</p>
</div>

</div>

<div id="outline-container-1-10" class="outline-4">
<h4 id="sec-1-10"><span class="section-number-4">1.10</span> Functions &amp; Methods </h4>
<div class="outline-text-4" id="text-1-10">

<p>Functions other than accessors and mutators shall be defined using
mixed case:
</p>
<p>
<code>MyFunction()</code>, <code>MyOtherFunction()</code>
</p>
<p>
Accessor and mutator methods shall match the name of the protected
variable:
</p>



<pre class="src src-C++">int m_private_var; // Private
private_var(); // Get
set_private_var(...); // Set
</pre>




<p>
All parameters passed by reference must be labeled <code>const</code>:
</p>



<pre class="src src-C++">void DoSomething(const std::string &amp;s);
</pre>




<p>
Do not use default function parameters in the parameter list.
</p>
</div>

</div>

<div id="outline-container-1-11" class="outline-4">
<h4 id="sec-1-11"><span class="section-number-4">1.11</span> Macros &amp; Preprocessor </h4>
<div class="outline-text-4" id="text-1-11">

<p>Macro and preprocessor names are defined using all uppercase with
underscores:
</p>
<p> 
<code>#define: MY_MACRO</code>
</p>
</div>

</div>

<div id="outline-container-1-12" class="outline-4">
<h4 id="sec-1-12"><span class="section-number-4">1.12</span> File Commments </h4>
<div class="outline-text-4" id="text-1-12">

<p>Each code file shall start with a descriptive header:
</p><ol>
<li>Program assignment number
</li>
<li>Author's name
</li>
<li>The date program development started
</li>
<li>A short description of the file's contents
</li>
</ol>


</div>

</div>

<div id="outline-container-1-13" class="outline-4">
<h4 id="sec-1-13"><span class="section-number-4">1.13</span> Class Comments </h4>
<div class="outline-text-4" id="text-1-13">

<p>Every class definition shall have an accompanying comment:
</p><ol>
<li>Description and purpose
</li>
<li>Usage
</li>
</ol>


</div>

</div>

<div id="outline-container-1-14" class="outline-4">
<h4 id="sec-1-14"><span class="section-number-4">1.14</span> Function &amp; Method Comments </h4>
<div class="outline-text-4" id="text-1-14">

<p>Every function definition shall have an accompanying comment:
</p><ol>
<li>Description and purpose
</li>
<li>Arguments (inputs and outputs) and allowed NULL parameters
</li>
<li>Return value
</li>
<li>Whether the function allocates memory that the caller must free
</li>
<li>Synchronization assumptions
</li>
</ol>


</div>

</div>

<div id="outline-container-1-15" class="outline-4">
<h4 id="sec-1-15"><span class="section-number-4">1.15</span> Variable Comments </h4>
<div class="outline-text-4" id="text-1-15">

<p>Each instance variable shall have an accompanying comment.
All global variables shall have an accompanying comment.
In general, non-instance and non-global variables do not need comments
if their names are sufficiently descriptive.
</p>
</div>

</div>

<div id="outline-container-1-16" class="outline-4">
<h4 id="sec-1-16"><span class="section-number-4">1.16</span> Spacing </h4>
<div class="outline-text-4" id="text-1-16">

<p>Separate each program construct with at least one space.
</p>
</div>

</div>

<div id="outline-container-1-17" class="outline-4">
<h4 id="sec-1-17"><span class="section-number-4">1.17</span> Indent </h4>
<div class="outline-text-4" id="text-1-17">

<p>Use only spaces for indentation.  One indent level equals 2 spaces.
</p>
</div>

</div>

<div id="outline-container-1-18" class="outline-4">
<h4 id="sec-1-18"><span class="section-number-4">1.18</span> Function Formatting </h4>
<div class="outline-text-4" id="text-1-18">

<p>Return type and function name declaration must be on the same line.
Function declaration parameters my be listed on multiple lines.
Function call parameter lists may be listed on multiple lines.
Matching braces should follow on their own lines.
</p>



<pre class="src src-C++">ReturnType ClassName::Fnc(Type p1, Type p2)
{
...
}
</pre>




</div>

</div>

<div id="outline-container-1-19" class="outline-4">
<h4 id="sec-1-19"><span class="section-number-4">1.19</span> Conditional Formatting </h4>
<div class="outline-text-4" id="text-1-19">

<p><b>if</b>, <b>else</b>, <b>else if</b> keywords should be placed on separate source
 lines.  One space should be used between <b>if</b> and parenthesis, but
 braces should follow on their own lines.
</p>



<pre class="src src-C++">if (condition) // Note single space after if
{ // Separate line
}
else
{
}

if (condition) return; // Bad, line spacing
if (condition)
  return; // OK
</pre>




</div>

</div>

<div id="outline-container-1-20" class="outline-4">
<h4 id="sec-1-20"><span class="section-number-4">1.20</span> Loop Formatting </h4>
<div class="outline-text-4" id="text-1-20">

<p>Empty loop bodies should use the <b>continue</b> keyword and not a lone
'<code>;</code>'.  One space should be used between the iterative keyword and
parenthesis, but braces should follow on their own lines.
</p>



<pre class="src src-C++">for (int j = 0; j &lt; 100; j++)
{
  // Do stuff
}

while (expression)
  continue;
</pre>




</div>

</div>

<div id="outline-container-1-21" class="outline-4">
<h4 id="sec-1-21"><span class="section-number-4">1.21</span> Class Formatting </h4>
<div class="outline-text-4" id="text-1-21">

<p>The base class name should precede on the same line as the subclass.
Matching braces should follow <span style="text-decoration:underline;">all</span> class definitions.  <b>public</b>,
<b>protected</b>, and <b>private</b> keywords shall be on their own line and
even with matching braces.
</p>



<pre class="src src-C++">class MyClass : public BaseClass
{
public:
  MyClass();

private:
  m_instance_var;
};
</pre>




</div>

</div>

<div id="outline-container-1-22" class="outline-4">
<h4 id="sec-1-22"><span class="section-number-4">1.22</span> Struct Formatting </h4>
<div class="outline-text-4" id="text-1-22">

<p><b>struct</b> declaration may follow definition.  Matching braces should
 follow <span style="text-decoration:underline;">all</span> <b>struct</b> definitions on their own lines.
</p>



<pre class="src src-C++">typedef struct &lt;name&gt;
{
  int j;
  int k;
} &lt;struct_name&gt;;
</pre>



</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2011-11-22 14:50:14 EST</p>
<p class="author">Author: Matthew J. Lenzo</p>
<p class="creator">Org version 7.7 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
